Revit 2027 API
MEPFamilyConnectorInfo.GetAssociateFamilyParameterId Method
 Gets the associate family parameter id of the specified connector parameter id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetAssociateFamilyParameterId(
	ElementId connectorParameterId
)
Public Function GetAssociateFamilyParameterId (
	connectorParameterId As ElementId
) As ElementId
public:
ElementId^ GetAssociateFamilyParameterId(
	ElementId^ connectorParameterId
)
member GetAssociateFamilyParameterId :
        connectorParameterId : ElementId -> ElementId
Parameters
connectorParameterId ElementId
 connectorParameterId is defined in the family connector element.
Return Value
ElementId
 Returns valid ElementId if the connectorParameterId associates to one family parameter; otherwise returns invalid ElementId.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPFamilyConnectorInfo Class
Autodesk.Revit.DB Namespace